#pragma once
#include<stddef.h>
/*
G01 2020 01 01 02 00 00-2.479893155396e-04-1.216449163621e-11 0.000000000000e+00
     7.300000000000e+01-2.093750000000e+01 4.376610874839e-09-4.335905824796e-01
    -1.069158315659e-06 9.235757635906e-03 3.784894943237e-06 5.153638858795e+03
     2.664000000000e+05 6.332993507385e-08-5.787103223850e-01 1.303851604462e-07
     9.785088475069e-01 3.136562500000e+02 7.594576020004e-01-8.299274269514e-09
    -5.857386840816e-11 1.000000000000e+00 2.086000000000e+03 0.000000000000e+00
     2.000000000000e+00 0.000000000000e+00 5.587935447693e-09 7.300000000000e+01
     2.592180000000e+05 4.000000000000e+00 
    1.1 计算卫星位置需要用到的星历数据：
1、星历参考时刻 toc：第一行第一个数据   23 11 02 08 00 00.0

2、卫星钟差 af0：第一行第二个数据   1.385881332680e-04

3、卫星钟偏 af1：第一行第三个数据   -6.030731469760e-11

4、卫星钟偏移 af2：第一行第四个数据   0.000000000000e+00

5、轨道半径改正项 Crs：第二行第二个数据   -2.278125000000e+02

6、角速度改正项 deltan：第二行第三个数据   -5.663093033410e-09

7、平近点角 M0：第二行第四个数据   -6.708219322780e-01

8、升交点角距改正 Cuc：第三行第一个数据   -7.327646017070e-06

9、偏心率 e：第三行第二个数据   7.320673903450e-04

10、升交点角距改正 Cus：第三行第三个数据   -1.202011480930e-05

11、轨道长半轴 sqrtA：第三行第四个数据   6.493444162370e+03

12、周内秒 toe：第四行第一个数据   3.744000000000e+05

13、轨道倾角改正项 Cic：第四行第二个数据   -5.634501576420e-08

14、升交点赤经 omega0：第四行第三个数据   -6.255581541050e-01

15、轨道倾角改正项 Cis：第四行第四个数据   3.259629011150e-08

16、轨道倾角 i0：第五行第一个数据   9.409420036110e-02

17、轨道半径改正项 Crc：第五行第二个数据   3.626718750000e+02

18、近地点角距 omega：第五行第三个数据   -1.792511645600e+00

19、赤经变化 omegaDot：第五行第四个数据   6.869929017260e-09

20、轨道倾角变率 IDOT：第六行第一个数据   2.378670509750e-10

21、卫星设备时延 TGD1：第七行第三个数据   2.999999970670e-10

1.2 计算卫星位置需要用到的常数
1、圆周率 pi：3.1415926535898

2、地球自转角速度 radv：7.2921151467e-5

3、地球标准引力常数 GM：3.986005e14

4、地球引力常数 F：-4.442807633e-10
*/
#define  pi 3.1415926535898
#define radv 7.2921151467e-5
#define GM 3.986005e14
#define F -4.442807633e-10
typedef struct Params{
    char _tag[3];               //卫星号
    int _t0c_year;                  //年
    int _t0c_month;                 //月
    int _t0c_day;                   //日
    int _t0c_hour;                  //时
    int _t0c_minutes;               //分
    int _t0c_second;                //秒
    double _af0;                  
    double _af1;
    double _af2;
    double _data_valid_time;
    double _Crs;
    double _deltan;
    double _M0;
    double _Cuc;
    double _e;
    double _Cus;
    double _sqrtA;
    double _toe;
    double _Cic;
    double _omega0;
    double _Cis;
    double _I0;//5.1
    double _Crc;
    double _omega;
    double _omegaDot;//5.4
    double _IDot;//6.1
    double _Idot;
    double _L2;
    double _GPS_week_num;
    double _L2P;
    double _m;
    double _TGD1; //7.3
    double _TOE;
    double _TGD;
    double _IODC;
    double _MSG_SEND_TIME;
    double _EMPTY;
}Params;